; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	infrared3 - mode
	image6 - mode
	image5 - mode
	thermograph1 - mode
	thermograph0 - mode
	infrared4 - mode
	thermograph2 - mode
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation4 - direction
	Planet5 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared3)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument2 image6)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation1)
	(supports instrument3 image6)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument4 thermograph0)
	(supports instrument4 infrared3)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star3)
	(supports instrument5 infrared4)
	(calibration_target instrument5 Star3)
	(supports instrument6 image6)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon7)
	(supports instrument7 thermograph2)
	(supports instrument7 image5)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 thermograph2)
	(supports instrument8 image5)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 GroundStation4)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet5)
)
(:goal (and
	(pointing satellite1 GroundStation0)
	(pointing satellite3 GroundStation2)
	(have_image Planet5 image6)
	(have_image Planet6 infrared4)
	(have_image Phenomenon7 image5)
	(have_image Planet8 infrared3)
	(have_image Phenomenon9 thermograph2)
	(have_image Phenomenon9 image6)
	(have_image Star10 infrared4)
	(have_image Star10 image6)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 image6)
	(have_image Star13 infrared4)
	(have_image Star13 image5)
))

)

; plan
1. (turn_to satellite3 groundstation0 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 groundstation0)
   goals met: 0 of 14
2. (switch_on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 0 of 14
3. (calibrate satellite3 instrument7 groundstation0)
   added: (calibrated instrument7)
   goals met: 0 of 14
4. (turn_to satellite3 phenomenon11 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 phenomenon11)
   goals met: 0 of 14
5. (turn_to satellite2 star3 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star3)
   goals met: 0 of 14
6. (turn_to satellite1 groundstation1 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation1)
   goals met: 0 of 14
7. (turn_to satellite0 groundstation2 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 14
8. (take_image satellite3 phenomenon11 instrument7 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 1 of 14
9. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 14
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 14
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 14
12. (calibrate satellite2 instrument4 star3)
   added: (calibrated instrument4)
   goals met: 1 of 14
13. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 1 of 14
14. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 14
15. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 1 of 14
16. (take_image satellite0 planet6 instrument0 infrared4)
   added: (have_image planet6 infrared4)
   goals met: 2 of 14
17. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 2 of 14
18. (take_image satellite0 star10 instrument0 infrared4)
   added: (have_image star10 infrared4)
   goals met: 3 of 14
19. (turn_to satellite0 star13 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star13)
   goals met: 3 of 14
20. (take_image satellite0 star13 instrument0 infrared4)
   added: (have_image star13 infrared4)
   goals met: 4 of 14
21. (turn_to satellite1 phenomenon9 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon9)
   goals met: 4 of 14
22. (take_image satellite1 phenomenon9 instrument2 image6)
   added: (have_image phenomenon9 image6)
   goals met: 5 of 14
23. (turn_to satellite1 planet12 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet12)
   goals met: 5 of 14
24. (take_image satellite1 planet12 instrument2 image6)
   added: (have_image planet12 image6)
   goals met: 6 of 14
25. (turn_to satellite1 planet5 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet5)
   goals met: 6 of 14
26. (take_image satellite1 planet5 instrument2 image6)
   added: (have_image planet5 image6)
   goals met: 7 of 14
27. (turn_to satellite1 star10 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star10)
   goals met: 7 of 14
28. (take_image satellite1 star10 instrument2 image6)
   added: (have_image star10 image6)
   goals met: 8 of 14
29. (turn_to satellite1 groundstation0 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 groundstation0)
   goals met: 9 of 14
30. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   goals met: 9 of 14
31. (take_image satellite2 phenomenon9 instrument4 thermograph2)
   added: (have_image phenomenon9 thermograph2)
   goals met: 10 of 14
32. (turn_to satellite2 planet8 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet8)
   goals met: 10 of 14
33. (take_image satellite2 planet8 instrument4 infrared3)
   added: (have_image planet8 infrared3)
   goals met: 11 of 14
34. (turn_to satellite3 phenomenon7 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon7)
   goals met: 11 of 14
35. (take_image satellite3 phenomenon7 instrument7 image5)
   added: (have_image phenomenon7 image5)
   goals met: 12 of 14
36. (turn_to satellite3 star13 phenomenon7)
   deleted: (pointing satellite3 phenomenon7)
   added: (pointing satellite3 star13)
   goals met: 12 of 14
37. (take_image satellite3 star13 instrument7 image5)
   added: (have_image star13 image5)
   goals met: 13 of 14
38. (turn_to satellite3 groundstation2 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 groundstation2)
   goals met: 14 of 14
